## Production: website
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       NAME                        |
|--------|---------------------------------------------------|
| add    | `aws_amplify_app.design_system_docs_en`           |
|        | `aws_amplify_app.design_system_docs_fr`           |
|        | `aws_amplify_branch.main_en`                      |
|        | `aws_amplify_branch.main_fr`                      |
|        | `aws_amplify_domain_association.design_system_en` |
|        | `aws_amplify_domain_association.design_system_fr` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_amplify_app.design_system_docs_en will be created
  + resource "aws_amplify_app" "design_system_docs_en" {
      + access_token      = (sensitive value)
      + arn               = (known after apply)
      + build_spec        = <<-EOT
            version: 1
            frontend:
              phases:
                preBuild:
                  commands:
                    - npm install
                build:
                  commands:
                    - npm run build
              artifacts:
                # IMPORTANT - Please verify your build output directory
                baseDirectory: _site/
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
        EOT
      + default_domain    = (known after apply)
      + id                = (known after apply)
      + name              = "Design System (EN)"
      + platform          = "WEB"
      + production_branch = (known after apply)
      + repository        = "https://github.com/cds-snc/gcds-docs"
      + tags_all          = (known after apply)

      + auto_branch_creation_config {
          + enable_auto_build             = true
          + enable_pull_request_preview   = true
          + pull_request_environment_name = "rc"
          + stage                         = "PRODUCTION"
        }

      + custom_rule {
          + source = "/<*>"
          + status = "404"
          + target = "/404"
        }
      + custom_rule {
          + source = "/fr/<*>"
          + status = "301"
          + target = "https://systeme-design.cdssandbox.xyz/fr/<*>"
        }
      + custom_rule {
          + source = "/"
          + status = "200"
          + target = "/en/"
        }
    }

  # aws_amplify_app.design_system_docs_fr will be created
  + resource "aws_amplify_app" "design_system_docs_fr" {
      + access_token      = (sensitive value)
      + arn               = (known after apply)
      + build_spec        = <<-EOT
            version: 1
            frontend:
              phases:
                preBuild:
                  commands:
                    - npm install
                build:
                  commands:
                    - npm run build
              artifacts:
                # IMPORTANT - Please verify your build output directory
                baseDirectory: _site/
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
        EOT
      + default_domain    = (known after apply)
      + id                = (known after apply)
      + name              = "Design System (FR)"
      + platform          = "WEB"
      + production_branch = (known after apply)
      + repository        = "https://github.com/cds-snc/gcds-docs"
      + tags_all          = (known after apply)

      + auto_branch_creation_config {
          + enable_auto_build             = true
          + enable_pull_request_preview   = true
          + pull_request_environment_name = "rc"
          + stage                         = "PRODUCTION"
        }

      + custom_rule {
          + source = "/<*>"
          + status = "404"
          + target = "/404"
        }
      + custom_rule {
          + source = "/en/<*>"
          + status = "301"
          + target = "https://design-system.cdssandbox.xyz/en/<*>"
        }
      + custom_rule {
          + source = "/"
          + status = "200"
          + target = "/fr/"
        }
    }

  # aws_amplify_branch.main_en will be created
  + resource "aws_amplify_branch" "main_en" {
      + app_id                      = (known after apply)
      + arn                         = (known after apply)
      + associated_resources        = (known after apply)
      + branch_name                 = "main"
      + custom_domains              = (known after apply)
      + destination_branch          = (known after apply)
      + display_name                = "production"
      + enable_auto_build           = true
      + enable_pull_request_preview = false
      + id                          = (known after apply)
      + source_branch               = (known after apply)
      + stage                       = "PRODUCTION"
      + tags_all                    = (known after apply)
    }

  # aws_amplify_branch.main_fr will be created
  + resource "aws_amplify_branch" "main_fr" {
      + app_id                      = (known after apply)
      + arn                         = (known after apply)
      + associated_resources        = (known after apply)
      + branch_name                 = "main"
      + custom_domains              = (known after apply)
      + destination_branch          = (known after apply)
      + display_name                = "production"
      + enable_auto_build           = true
      + enable_pull_request_preview = false
      + id                          = (known after apply)
      + source_branch               = (known after apply)
      + stage                       = "PRODUCTION"
      + tags_all                    = (known after apply)
    }

  # aws_amplify_domain_association.design_system_en will be created
  + resource "aws_amplify_domain_association" "design_system_en" {
      + app_id                              = (known after apply)
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "design-system.cdssandbox.xyz"
      + enable_auto_sub_domain              = false
      + id                                  = (known after apply)
      + wait_for_verification               = false

      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
    }

  # aws_amplify_domain_association.design_system_fr will be created
  + resource "aws_amplify_domain_association" "design_system_fr" {
      + app_id                              = (known after apply)
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "systeme-design.cdssandbox.xyz"
      + enable_auto_sub_domain              = false
      + id                                  = (known after apply)
      + wait_for_verification               = false

      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.design_system_docs_en"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.design_system_docs_fr"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main_en"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main_fr"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
